
public class Test {
//	tab制表符                    数组
	public static void main(String[] args) {
		int a = 100;
		System.out.println(a);
//		计算圆面积
		int r = 10;
		System.out.println(3.14*r*r);
//		常量大写，大写的就是常量
//		类名首字母大写，首字母就是类名
//		其他：驼峰命名法Camel-Case
//		名字有含义
//		true真，false假。逻辑常量有（）（），boolean
//		{}语句块
//		ctrl + / 单行注释
		/* 多行注释
		 */
		/** 文档注释
		 *  在此内容，可以通过命令生成说明文档
		 */
//		函数名后有小括号，见到小括号左边是函数名
//		简单数据类型:数值类型、字符类型、布尔类型
//		整数数据类型：123
//		小数/浮点数据类型：12.5 1.2e5
//		字符类型： ‘a’、‘8’
//		a 常量
//		AAAA 变量
//		"AAAA" 字符串类，复合数据类型
//		简单数据类型就是一个值
//		复合数据函数：值、属性和方法
//		1101 -> 1110
//		十进制99-> 10^2-1   999-> 10^3-1
//		二进制11->  2^2-1   111->  2^3-1
//		n位二进制数最大 2^n-1
//		数字、字母、_、$ 不能以数字开头
//		int a; 声明变量，整数，只能放整数
//		int b = 35; 赋值，从右到左
//		int c = 40, d = 57； 声明多个变量 ，给初值
//		int c = 40; int = 57
//		作业：1.预习二进制
//		2.把课堂笔记内容，自己写一下，上传java文件
	}

}
